Tekla Open API Reference for Tekla Structures 2025
LoadArea.DistanceA Property
 The distance a (for enlarging or reducing the loaded area).
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public double DistanceA { get; set; }
Public Property DistanceA As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
LoadArea Class
Tekla.Structures.Model Namespace